In [9]:
import pandas as pd

In [10]:
dataFrame = pd.read_excel("PandasOrnekExcel.xlsx")

In [11]:
type(dataFrame)

pandas.core.frame.DataFrame

In [12]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0      Yusuf   150  23.0    Yazılım
1      Ahmet   300   NaN      Hukuk
2     Mehmet   200  35.0  Pazarlama
3        Ali   100  32.0        NaN

In [14]:
doluDegerlerDataFrame = dataFrame.dropna()

In [15]:
doluDegerlerDataFrame

  Unnamed: 0  Maas   Yas  Departman
0      Yusuf   150  23.0    Yazılım
2     Mehmet   200  35.0  Pazarlama

In [18]:
doluDegerlerDataFrame.to_excel("YeniPandasOrnekExcel.xlsx")
#yeni excel tablosu oluşturuldu